# FabricationPartRouteEnd Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FabricationPartRouteEnd Class
Members See Also
---
Class to hold fabrication part routing start or end information.
**Namespace:** Autodesk.Revit.DB.Fabrication**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public class FabricationPartRouteEnd : IDisposable
```

Visual Basic
---
```text
Public Class FabricationPartRouteEnd _
	Implements IDisposable
```

Visual C++
---
```text
public ref class FabricationPartRouteEnd : IDisposable
```

# Remarks
To create a new instance, use CreateFromConnector(Connector) to specify a connector, or CreateFromCenterline(Element, XYZ) to specify the centerline of a straight element, for the fabrication routing end point.
# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB.Fabrication..::..FabricationPartRouteEnd
# See Also
FabricationPartRouteEnd Members
Autodesk.Revit.DB.Fabrication Namespace